package ui;


import javax.swing.*;
import java.awt.*;

public class AboutScreen extends JPanel {

    public AboutScreen(AppController controller) {

        setLayout(new BorderLayout());

        JLabel label = new JLabel("Το StateBudgetManager είναι μια εφαρμογή που επιτρέπει στον χρήστη να εξερευνήσει, \" +\r\n" + //
                        "        \"να κατανοήσει και να αλληλεπιδράσει με τον κρατικό προϋπολογισμό με απλό και οργανωμένο τρόπο. \" +\r\n" + //
                        "        \"Παρέχει πρόσβαση σε βασικές κατηγορίες εσόδων και δαπανών, ομαδοποιημένες πληροφορίες, \" +\r\n" + //
                        "        \"και δυνατότητα προβολής των συνολικών μεγεθών, ώστε ο χρήστης να έχει μια καθαρή και άμεση εικόνα \" +\r\n" + //
                        "        \"της δημοσιονομικής δομής.\\n" + //
                        "\\n" + //
                        "\" +\r\n" + //
                        "\r\n" + //
                        "        \"Ο σκοπός της εφαρμογής είναι να δώσει στους νέους τη δυνατότητα να αναπτύξουν μια πιο ολοκληρωμένη, \" +\r\n" + //
                        "        \"δομημένη και συνειδητή οικονομική και πολιτική αντίληψη. Με άμεση πρόσβαση στον προϋπολογισμό, οι χρήστες \" +\r\n" + //
                        "        \"μπορούν να κατανοούν καλύτερα πώς καταγράφονται τα δημόσια έσοδα και πού κατευθύνονται οι δημόσιες δαπάνες, \" +\r\n" + //
                        "        \"ενισχύοντας έτσι την ενεργή συμμετοχή και τη γνώση γύρω από κρίσιμες οικονομικές αποφάσεις.\\n" + //
                        "\\n" + //
                        "\" +\r\n" + //
                        "\r\n" + //
                        "        \"Κεντρικό στοιχείο της εφαρμογής αποτελεί η δυνατότητα δημιουργίας και επεξεργασίας σεναρίων αλλαγών, \" +\r\n" + //
                        "        \"επιτρέποντας στον χρήστη να εξετάζει τις επιπτώσεις πιθανών μεταβολών σε διάφορα δημοσιονομικά μεγέθη. \" +\r\n" + //
                        "        \"Επιπλέον, η εφαρμογή προσφέρει εργαλεία για παραγωγή αναφορών, προβολή δεδομένων με δομημένους πίνακες \" +\r\n" + //
                        "        \"και εύκολη κατηγοριοποίηση των πληροφοριών.\\n" + //
                        "\\n" + //
                        "\" +\r\n" + //
                        "\r\n" + //
                        "        \"Με αυτόν τον τρόπο, το StateBudgetManager λειτουργεί ως εκπαιδευτικό και πρακτικό εργαλείο, ικανό να βοηθήσει \" +\r\n" + //
                        "        \"άτομα που επιθυμούν να κατανοήσουν βαθύτερα τον τρόπο λειτουργίας του κράτους μέσα από έναν από τους πιο \" +\r\n" + //
                        "        \"σημαντικούς θεσμούς του — τον προϋπολογισμό.", SwingConstants.CENTER);

        JButton back = new JButton("Back");
        back.addActionListener(e -> controller.showScreen(AppController.LANDING));

        add(label, BorderLayout.CENTER);
        add(back, BorderLayout.SOUTH);
    }
}
